## Database Clients

***

## Project Description

Little Lemon is a family-owned Mediterranean restaurant. They are developing a Python-based application that needs to connect with the MySQL database so that the booking, menu and orders data can be stored in the respective tables. 

The restaurant owner wants to use the stored data to make data-driven decisions to increase their revenue. Establishing a database is one of their key objectives.

### Import Libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import random

import datetime
from datetime import datetime, timedelta
import scipy.stats

#import sqlite3
import sqlite3 as sq3
from sqlite3 import Connection

import sqlalchemy.pool as pool


import warnings
warnings.filterwarnings('ignore')

%matplotlib inline
#sets the default autosave frequency in seconds
%autosave 60 
sns.set_style('dark')
sns.set(font_scale=1.2)

plt.rc('axes', titlesize=9)
plt.rc('axes', labelsize=14)
plt.rc('xtick', labelsize=12)
plt.rc('ytick', labelsize=12)

pd.set_option('display.max_columns',None)
#pd.set_option('display.max_rows',None)
pd.set_option('display.width', 1000)
pd.option_context('float_format','{:.2f}'.format)

random.seed(0)
np.random.seed(0)
np.set_printoptions(suppress=True)

Autosaving every 60 seconds

In [2]:
%%capture
#%load_ext sql
#%sql sqlite://chinook.db
#%sql mysql://studentuser:studentpw@localhost/dognitiondb
#%sql USE dognitiondb

## Upload Data to Database

In [ ]:
con = sq3.connect("client.db")

In [ ]:
con

In [ ]:
con.execute("Select * FROM sqlite_master").fetchall()

In [ ]:
#MenuItems table
create_menuitem_table = """CREATE TABLE MenuItems (
ItemID INT AUTO_INCREMENT,
Name VARCHAR(200),
Type VARCHAR(100),
Price INT,
PRIMARY KEY (ItemID)
);"""

In [ ]:
#MenuTable table
create_menu_table = """CREATE TABLE Menus (
MenuID INT,
ItemID INT,
Cuisine VARCHAR(100),
PRIMARY KEY (MenuID,ItemID)
);"""

In [ ]:
#BookingTable table
create_booking_table = """CREATE TABLE Bookings (
BookingID INT AUTO_INCREMENT,
TableNo INT,
GuestFirstName VARCHAR(100) NOT NULL,
GuestLastName VARCHAR(100) NOT NULL,
BookingSlot TIME NOT NULL,
EmployeeID INT,
PRIMARY KEY (BookingID)
);"""

In [ ]:
#CreateOrders table
create_orders_table = """CREATE TABLE Orders (
OrderID INT,
TableNo INT,
MenuID INT,
BookingID INT,
BillAmount INT,
Quantity INT,
PRIMARY KEY (OrderID,TableNo)
);"""

In [ ]:
#Employees table
create_employees_table = """CREATE TABLE Employees (
EmployeeID INT AUTO_INCREMENT PRIMARY KEY,
Name VARCHAR,
Role VARCHAR,
Address VARCHAR,
Contact_Number INT,
Email VARCHAR,
Annual_Salary VARCHAR
);"""

In [ ]:
# Create MenuItems table
con.execute(create_menuitem_table)

# Create Menu table
con.execute(create_menu_table)

# Create Bookings table
con.execute(create_booking_table)

# Create Orders table
con.execute(create_orders_table)

# Create Employees table
con.execute(create_employees_table)

In [ ]:
#con.execute("Select * FROM sqlite_master").fetchall()

In [ ]:
pd.read_sql_query("Select * FROM sqlite_master", con) #Check all tables inside database

In [ ]:
#*******************************************************#
# Insert query to populate "MenuItems" table:
#*******************************************************#
insert_menuitems="""
INSERT INTO MenuItems (ItemID, Name, Type, Price)
VALUES
(1, 'Olives','Starters',5),
(2, 'Flatbread','Starters', 5),
(3, 'Minestrone', 'Starters', 8),
(4, 'Tomato bread','Starters', 8),
(5, 'Falafel', 'Starters', 7),
(6, 'Hummus', 'Starters', 5),
(7, 'Greek salad', 'Main Courses', 15),
(8, 'Bean soup', 'Main Courses', 12),
(9, 'Pizza', 'Main Courses', 15),
(10, 'Greek yoghurt','Desserts', 7),
(11, 'Ice cream', 'Desserts', 6),
(12, 'Cheesecake', 'Desserts', 4),
(13, 'Athens White wine', 'Drinks', 25),
(14, 'Corfu Red Wine', 'Drinks', 30),
(15, 'Turkish Coffee', 'Drinks', 10),
(16, 'Turkish Coffee', 'Drinks', 10),
(17, 'Kabasa', 'Main Courses', 17);"""

In [ ]:
#*******************************************************#
# Insert query to populate "Menu" table:
#*******************************************************#
insert_menu="""
INSERT INTO Menus (MenuID,ItemID,Cuisine)
VALUES
(1, 1, 'Greek'),
(1, 7, 'Greek'),
(1, 10, 'Greek'),
(1, 13, 'Greek'),
(2, 3, 'Italian'),
(2, 9, 'Italian'),
(2, 12, 'Italian'),
(2, 15, 'Italian'),
(3, 5, 'Turkish'),
(3, 17, 'Turkish'),
(3, 11, 'Turkish'),
(3, 16, 'Turkish');"""

In [ ]:
#*******************************************************#
# Insert query to populate "Bookings" table:
#*******************************************************#
insert_bookings="""
INSERT INTO Bookings (BookingID, TableNo, GuestFirstName, 
GuestLastName, BookingSlot, EmployeeID)
VALUES
(1, 12, 'Anna','Iversen','19:00:00',1),
(2, 12, 'Joakim', 'Iversen', '19:00:00', 1),
(3, 19, 'Vanessa', 'McCarthy', '15:00:00', 3),
(4, 15, 'Marcos', 'Romero', '17:30:00', 4),
(5, 5, 'Hiroki', 'Yamane', '18:30:00', 2),
(6, 8, 'Diana', 'Pinto', '20:00:00', 5);"""

In [ ]:
#*******************************************************#
# Insert query to populate "Orders" table:
#*******************************************************#
insert_orders="""
INSERT INTO Orders (OrderID, TableNo, MenuID, BookingID, Quantity, BillAmount)
VALUES
(1, 12, 1, 1, 2, 86),
(2, 19, 2, 2, 1, 37),
(3, 15, 2, 3, 1, 37),
(4, 5, 3, 4, 1, 40),
(5, 8, 1, 5, 1, 43);"""

In [ ]:
#*******************************************************#
# Insert query to populate "Employees" table:
#*******************************************************#
insert_employees = """
INSERT INTO Employees (EmployeeID, Name, Role, Address, Contact_Number, Email, Annual_Salary)
VALUES
(01,'Mario Gollini','Manager','724, Parsley Lane, Old Town, Chicago, IL',351258074,'Mario.g@littlelemon.com','$70,000'),
(02,'Adrian Gollini','Assistant Manager','334, Dill Square, Lincoln Park, Chicago, IL',351474048,'Adrian.g@littlelemon.com','$65,000'),
(03,'Giorgos Dioudis','Head Chef','879 Sage Street, West Loop, Chicago, IL',351970582,'Giorgos.d@littlelemon.com','$50,000'),
(04,'Fatma Kaya','Assistant Chef','132  Bay Lane, Chicago, IL',351963569,'Fatma.k@littlelemon.com','$45,000'),
(05,'Elena Salvai','Head Waiter','989 Thyme Square, EdgeWater, Chicago, IL',351074198,'Elena.s@littlelemon.com','$40,000'),
(06,'John Millar','Receptionist','245 Dill Square, Lincoln Park, Chicago, IL',351584508,'John.m@littlelemon.com','$35,000');"""

In [ ]:
# Populate MenuItems table
con.execute(insert_menuitems)
con.commit()

In [ ]:
# Populate MenuItems table
con.execute(insert_menu)
con.commit()

In [ ]:
# Populate Bookings table
con.execute(insert_bookings)
con.commit()

In [ ]:
# Populate Orders table
con.execute(insert_orders)
con.commit()

In [ ]:
# Populate Employees table
con.execute(insert_employees)
con.commit()

In [ ]:
con.close()

### SQLite

In [3]:
db = sq3.connect("client.db") #Create connection

In [4]:
cursor = db.cursor()

In [5]:
# List all the tables in the database.

cursor = db.cursor()

cursor.execute("SELECT * FROM sqlite_master;")

available_table=(cursor.fetchall())

In [6]:
available_table

[('table',
  'MenuItems',
  'MenuItems',
  2,
  'CREATE TABLE MenuItems (\nItemID INT AUTO_INCREMENT,\nName VARCHAR(200),\nType VARCHAR(100),\nPrice INT,\nPRIMARY KEY (ItemID)\n)'),
 ('index', 'sqlite_autoindex_MenuItems_1', 'MenuItems', 3, None),
 ('table',
  'Menus',
  'Menus',
  4,
  'CREATE TABLE Menus (\nMenuID INT,\nItemID INT,\nCuisine VARCHAR(100),\nPRIMARY KEY (MenuID,ItemID)\n)'),
 ('index', 'sqlite_autoindex_Menus_1', 'Menus', 5, None),
 ('table',
  'Bookings',
  'Bookings',
  6,
  'CREATE TABLE Bookings (\nBookingID INT AUTO_INCREMENT,\nTableNo INT,\nGuestFirstName VARCHAR(100) NOT NULL,\nGuestLastName VARCHAR(100) NOT NULL,\nBookingSlot TIME NOT NULL,\nEmployeeID INT,\nPRIMARY KEY (BookingID)\n)'),
 ('index', 'sqlite_autoindex_Bookings_1', 'Bookings', 7, None),
 ('table',
  'Orders',
  'Orders',
  8,
  'CREATE TABLE Orders (\nOrderID INT,\nTableNo INT,\nMenuID INT,\nBookingID INT,\nBillAmount INT,\nQuantity INT,\nPRIMARY KEY (OrderID,TableNo)\n)'),
 ('index', 'sqlite_autoindex_Orders_1', 'Orders', 9, None),
 ('table',
  'Employees',
  'Employees',
  10,
  'CREATE TABLE Employees (\nEmployeeID INT AUTO_INCREMENT PRIMARY KEY,\nName VARCHAR,\nRole VARCHAR,\nAddress VARCHAR,\nContact_Number INT,\nEmail VARCHAR,\nAnnual_Salary VARCHAR\n)'),
 ('index', 'sqlite_autoindex_Employees_1', 'Employees', 11, None)]

## Write SQL Queries

In [7]:
pd.read_sql_query('SELECT * FROM sqlite_master;', db)

    type                          name   tbl_name  rootpage                                                sql
0  table                     MenuItems  MenuItems         2  CREATE TABLE MenuItems (\nItemID INT AUTO_INCR...
1  index  sqlite_autoindex_MenuItems_1  MenuItems         3                                               None
2  table                         Menus      Menus         4  CREATE TABLE Menus (\nMenuID INT,\nItemID INT,...
3  index      sqlite_autoindex_Menus_1      Menus         5                                               None
4  table                      Bookings   Bookings         6  CREATE TABLE Bookings (\nBookingID INT AUTO_IN...
5  index   sqlite_autoindex_Bookings_1   Bookings         7                                               None
6  table                        Orders     Orders         8  CREATE TABLE Orders (\nOrderID INT,\nTableNo I...
7  index     sqlite_autoindex_Orders_1     Orders         9                                               None
8  table                     Employees  Employees        10  CREATE TABLE Employees (\nEmployeeID INT AUTO_...
9  index  sqlite_autoindex_Employees_1  Employees        11                                               None

In [8]:
pd.read_sql_query("SELECT * FROM MenuItems", db)

    ItemID               Name          Type  Price
0        1             Olives      Starters      5
1        2          Flatbread      Starters      5
2        3         Minestrone      Starters      8
3        4       Tomato bread      Starters      8
4        5            Falafel      Starters      7
5        6             Hummus      Starters      5
6        7        Greek salad  Main Courses     15
7        8          Bean soup  Main Courses     12
8        9              Pizza  Main Courses     15
9       10      Greek yoghurt      Desserts      7
10      11          Ice cream      Desserts      6
11      12         Cheesecake      Desserts      4
12      13  Athens White wine        Drinks     25
13      14     Corfu Red Wine        Drinks     30
14      15     Turkish Coffee        Drinks     10
15      16     Turkish Coffee        Drinks     10
16      17             Kabasa  Main Courses     17

In [9]:
pd.read_sql_query("SELECT * FROM Menus", db)

    MenuID  ItemID  Cuisine
0        1       1    Greek
1        1       7    Greek
2        1      10    Greek
3        1      13    Greek
4        2       3  Italian
5        2       9  Italian
6        2      12  Italian
7        2      15  Italian
8        3       5  Turkish
9        3      17  Turkish
10       3      11  Turkish
11       3      16  Turkish

In [10]:
pd.read_sql_query("SELECT * FROM Bookings", db)

   BookingID  TableNo GuestFirstName GuestLastName BookingSlot  EmployeeID
0          1       12           Anna       Iversen    19:00:00           1
1          2       12         Joakim       Iversen    19:00:00           1
2          3       19        Vanessa      McCarthy    15:00:00           3
3          4       15         Marcos        Romero    17:30:00           4
4          5        5         Hiroki        Yamane    18:30:00           2
5          6        8          Diana         Pinto    20:00:00           5

In [11]:
pd.read_sql_query("SELECT * FROM Orders", db)

   OrderID  TableNo  MenuID  BookingID  BillAmount  Quantity
0        1       12       1          1          86         2
1        2       19       2          2          37         1
2        3       15       2          3          37         1
3        4        5       3          4          40         1
4        5        8       1          5          43         1

In [12]:
pd.read_sql_query("SELECT * FROM Employees", db)

   EmployeeID             Name               Role                                      Address  Contact_Number                      Email Annual_Salary
0           1    Mario Gollini            Manager     724, Parsley Lane, Old Town, Chicago, IL       351258074    Mario.g@littlelemon.com       $70,000
1           2   Adrian Gollini  Assistant Manager  334, Dill Square, Lincoln Park, Chicago, IL       351474048   Adrian.g@littlelemon.com       $65,000
2           3  Giorgos Dioudis          Head Chef      879 Sage Street, West Loop, Chicago, IL       351970582  Giorgos.d@littlelemon.com       $50,000
3           4       Fatma Kaya     Assistant Chef                   132  Bay Lane, Chicago, IL       351963569    Fatma.k@littlelemon.com       $45,000
4           5     Elena Salvai        Head Waiter     989 Thyme Square, EdgeWater, Chicago, IL       351074198    Elena.s@littlelemon.com       $40,000
5           6      John Millar       Receptionist   245 Dill Square, Lincoln Park, Chicago, IL       351584508     John.m@littlelemon.com       $35,000

In [13]:
def getconn():
    c = sq3.connect("client.db")
    return c

In [14]:
mypool = pool.QueuePool(getconn, max_overflow=10, pool_size=5)

In [15]:
mypool

In [16]:
# get a connection
conn = mypool.connect()

In [17]:
conn

In [18]:
# use it
cursor_obj = conn.cursor()
cursor_obj.execute("SELECT * FROM Employees")

In [ ]:
stored_procedure_query="""

CREATE PROCEDURE PeakHours()

BEGIN

SELECT 
HOUR(BookingSlot) AS Booking_Hour,
COUNT(HOUR(BookingSlot)) AS n_Bookings
FROM Bookings
GROUP BY Booking_Hour
ORDER BY n_Bookings DESC;

END

"""

In [ ]:
cursor_obj.execute(stored_procedure_query)

In [ ]:
pd.read_sql_query("CREATE PROCEDURE PeakHours()\
                   BEGIN\
                   SELECT\
                   HOUR(BookingSlot) AS Booking_Hour,\
                   COUNT(HOUR(BookingSlot)) AS n_Bookings\
                   FROM Bookings\
                   GROUP BY Booking_Hour\
                   ORDER BY n_Bookings DESC;\
                   END ", db)

***

#### Python code done by Dennis Lam